DataProcessors/МедицинскиеОсмотры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>МедицинскиеОсмотры</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ВредныеФакторыРабочегоМеста.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ВредныеФакторыРабочегоМеста</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВредныйФактор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВредныеОпасныеПроизводственныеФакторы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОсмотра</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбследований</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ВидыРаботМедицинскихОсмотровРабочегоМеста.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ВидыРаботМедицинскихОсмотровРабочегоМеста</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРабот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРаботМедицинскихОсмотров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОсмотра</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбследований</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ВредныеФакторыИВидыРаботРабочегоМеста.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ВредныеФакторыИВидыРаботРабочегоМеста</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РезультатыСпецоценкиУсловийТруда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВредныйФактор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВредныеОпасныеПроизводственныеФакторыИВыполняемыеРаботы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОсмотра</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбследований</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОбновлениеПериодическихМедицинскихОсмотров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ОбновлениеПериодическихМедицинскихОсмотров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПериодичностьМедицинскихОсмотровРабочихМест.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПериодичностьМедицинскихОсмотровРабочихМест</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КратностьОсмотра</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодичностьОсмотра</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаПериодичностиОсмотра</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредставлениеПериодичностиОсмотра</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВредныеФакторыПолноеПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидыРаботПолноеПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВредныеФакторыКодыПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидыРаботКодыПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Однократно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОсмотра</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбследований</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыОбследований.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыОбследований</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>МедицинскийОсмотр</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПсихиатрическоеОсвидетельствование</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыМедицинскогоОсмотра.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыМедицинскогоОсмотра</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Предварительный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Периодический</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Внеплановый</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/РезультатыМедицинскогоОсмотра.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>РезультатыМедицинскогоОсмотра</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеИмеетПротивопоказаний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИмеетПротивопоказания</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаключениеМедицинскогоОсмотра.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ЗаключениеМедицинскогоОсмотра</Name>
			<BasedOn>
				<xr:Item>Document.НаправлениеНаМедицинскийОсмотр</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.УдалитьМедицинскиеОсмотры</xr:Item>
				<xr:Item>InformationRegister.МедицинскиеОсмотрыПоВидамРабот</xr:Item>
				<xr:Item>InformationRegister.МедицинскиеОсмотрыПоВреднымФакторам</xr:Item>
				<xr:Item>InformationRegister.МедицинскиеОсмотры</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПозиция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НаправлениеНаМедицинскийОсмотр</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОсмотра</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОсмотра</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбследований</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОсмотра</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыМедицинскогоОсмотра</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатОсмотра</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РезультатыМедицинскогоОсмотра</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПояснениеРезультата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВредныеФакторыИВидыРабот</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВредныйФактор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВредныеОпасныеПроизводственныеФакторыИВыполняемыеРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВредныеФакторы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВредныйФактор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВредныеОпасныеПроизводственныеФакторы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыРабот</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидРабот</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыРаботМедицинскихОсмотров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/МедицинскиеОсмотры/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Организация") Тогда
		Организация = Параметры["Организация"];
	КонецЕсли;
	
	Если Параметры.Свойство("ВидОсмотра") Тогда
		ВидОсмотра = Параметры["ВидОсмотра"];
		Если ВидОсмотра = Перечисления.ВидыОбследований.ПсихиатрическоеОсвидетельствование Тогда
			АвтоЗаголовок = Ложь;
			Заголовок = НСтр("ru = 'Психиатрические освидетельствования'");
			Элементы.ПояснениеИспользованияНадпись.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(
				НСтр("ru = 'Для выбранной организации не обнаружено <a href=""e1cib/list/Справочник.РабочиеМестаОхраныТруда"">рабочих мест</a> с заполненным перечнем вредных (опасных) производственных факторов или видов работ, выполнение которых требует прохождения обязательных психиатрических освидетельствований.
				|Заполнить перечень вредных факторов для рабочих мест можно на странице «Рабочие места».'"));
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.Свойство("ИмяСтраницы") Тогда
		Элементы.СтраницыГруппа.ТекущаяСтраница = Элементы[Параметры.ИмяСтраницы];
	КонецЕсли;
	
	Если Параметры.Свойство("ПроверятьУстаревшиеВредныеФакторыИВидыРабот") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			РабочиеМеста, "ЕстьУстаревшиеВредныеФакторыИВидыРабот", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "СотрудникиСтраница", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ПользовательскиеНастройкиРабочихМестГруппа", "Видимость", Ложь);
	КонецЕсли;
	
	ЗаполнитьНачальныеЗначения();
	
	ТекущаяДата = ТекущаяДатаСеанса();
	
	УстановитьПараметрВидОсмотра(ЭтотОбъект);
	УстановитьПараметрТекущаяДата(ЭтотОбъект, ТекущаяДата);
	УстановитьОтборПоОрганизации(ЭтотОбъект);
	УстановитьОтборПоПодразделению(ЭтотОбъект);
	
	УстановитьОтборТолькоБлижайшиеОсмотры(ЭтотОбъект, ТекущаяДата, ПоказыватьТолькоБлижайшиеОсмотры);
	ДоработатьПользовательскиеНастройкиСпискаРабочихМест();
	
	ПроверитьСтраницуСоответствия(ЭтотОбъект);
	УстановитьОтборСоответствий(ЭтотОбъект, "СоответствиеПодтверждено", ПоказыватьТолькоТребующиеПодтверждения);
	
	УстановитьУсловноеОформление();
	
	ВсеПозицииБезВредности = ВсеПозицииБезВредности(Организация, ВидОсмотра);
	УстановитьНадписьПояснениеПустогоСпискаПериодическихОсмотров(ЭтотОбъект, ВсеПозицииБезВредности);
	
	ЕстьНеактуальныеЗаписи = ЕстьНеактуальныеЗаписиПериодическихОсмотров(Организация);
	УстановитьНадписьОбновитьПериодическиеОсмотры(ЭтотОбъект, ЕстьНеактуальныеЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодключитьОбработчикОжидания("ПроверитьНаличиеНеактуальныхЗаписейПериодическихОсмотров", 60);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	ОбновитьПериодическиеОсмотры = Ложь;
	Если ИмяСобытия = "Запись_НазначениеРабочихМестСотрудникам" Тогда
		ПроверитьНаличиеНеактуальныхЗаписейПериодическихОсмотров();
		ОбновитьПериодическиеОсмотры = Истина;
	ИначеЕсли ИмяСобытия = "Запись_ПриемНаРаботу" Тогда
		ПроверитьНаличиеНеактуальныхЗаписейПериодическихОсмотров();
		ОбновитьПериодическиеОсмотры = Истина;
	ИначеЕсли ИмяСобытия = "Запись_ПриемНаРаботуСписком" Тогда
		ПроверитьНаличиеНеактуальныхЗаписейПериодическихОсмотров();
		ОбновитьПериодическиеОсмотры = Истина;
	ИначеЕсли ИмяСобытия = "Запись_КадровыйПеревод" Тогда
		ПроверитьНаличиеНеактуальныхЗаписейПериодическихОсмотров();
		ОбновитьПериодическиеОсмотры = Истина;
	ИначеЕсли ИмяСобытия = "Запись_КадровыйПереводСписком" Тогда
		ПроверитьНаличиеНеактуальныхЗаписейПериодическихОсмотров();
		ОбновитьПериодическиеОсмотры = Истина;
	ИначеЕсли ИмяСобытия = "Запись_НаправлениеНаМедицинскийОсмотр" Тогда
		ПроверитьНаличиеНеактуальныхЗаписейПериодическихОсмотров();
		ОбновитьПериодическиеОсмотры = Истина;
	ИначеЕсли ИмяСобытия = "Запись_ЗаключениеМедицинскогоОсмотра" Тогда
		ПроверитьНаличиеНеактуальныхЗаписейПериодическихОсмотров();
		ОбновитьПериодическиеОсмотры = Истина;
	ИначеЕсли ИмяСобытия = "Запись_РабочиеМестаОхраныТруда" Тогда
		ПроверитьНаличиеНеактуальныхЗаписейПериодическихОсмотров();
		ОбновитьПериодическиеОсмотры = Истина;
		Элементы.РабочиеМеста.Обновить();
	ИначеЕсли ИмяСобытия = "Запись_ВредныйФактор" Тогда
		Если Элементы.СопоставлениеСтраница.Видимость Тогда
			Элементы.СоответствиеПеречнейВредныхФакторов.Обновить();
		КонецЕсли;
		Элементы.РабочиеМеста.Обновить();
		ОбновитьПериодическиеОсмотры = Истина;
	ИначеЕсли ИмяСобытия = "Запись_РезультатыСпецоценкиУсловийТруда" Тогда
		ПроверитьНаличиеНеактуальныхЗаписейПериодическихОсмотров();
		ОбновитьПериодическиеОсмотры = Истина;
		Элементы.РабочиеМеста.Обновить();
	КонецЕсли;
	
	Если ОбновитьПериодическиеОсмотры И Элементы.СотрудникиСтраница.Видимость Тогда
		Элементы.ПериодическиеОсмотры.Обновить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	УстановитьОтборПоОрганизации(ЭтотОбъект);
	УстановитьОтборПоПодразделению(ЭтотОбъект);
	ОрганизацияПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	УстановитьОтборПоПодразделению(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьТолькоБлижайшиеОсмотрыПриИзменении(Элемент)
	УстановитьОтборТолькоБлижайшиеОсмотры(ЭтотОбъект, ОбщегоНазначенияКлиент.ДатаСеанса(), ПоказыватьТолькоБлижайшиеОсмотры);
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеДанныхНадписьОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	НачатьОбновлениеПериодическихОсмотров();
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьТолькоТребующиеПодтвержденияПриИзменении(Элемент)
	УстановитьОтборСоответствий(ЭтотОбъект, "СоответствиеПодтверждено", ПоказыватьТолькоТребующиеПодтверждения);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПериодическиеОсмотры

&НаКлиенте
Процедура ПериодическиеОсмотрыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.ПериодическиеОсмотры.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьСотрудника(ТекущиеДанные, Поле);
	ОткрытьПозицию(ТекущиеДанные, Поле);
	ОткрытьРабочееМесто(ТекущиеДанные, Поле);
	ОткрытьНаправление(ТекущиеДанные, Поле);
	ОткрытьЗаключение(ТекущиеДанные, Поле);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПериодическиеОсмотрыПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	ОформитьСтрокиПериодическихОсмотров(ИмяЭлемента, Настройки, Строки);	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРабочиеМеста

&НаКлиенте
Процедура РабочиеМестаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.РабочиеМеста.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле.Имя <> "РабочиеМестаНаименование" Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Ключ", ТекущиеДанные["Ссылка"]);
	
	ОткрытьФорму("Справочник.РабочиеМестаОхраныТруда.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСоответствиеПеречнейВредныхФакторов

&НаКлиенте
Процедура СоответствиеПеречнейВредныхФакторовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.СоответствиеПеречнейВредныхФакторов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьЗначение(, ТекущиеДанные["Ссылка"]);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СформироватьНаправления(Команда)
	НачатьФормированиеНаправлений();
КонецПроцедуры

&НаКлиенте
Процедура ВвестиЗаключения(Команда)
	НачатьФормированиеЗаключений();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ВводНаправлений

&НаСервере
Процедура ЗаполнитьДанныеОсмотров(ДанныеОсмотров)
	
	Для Каждого ДанныеСтроки Из Элементы.ПериодическиеОсмотры.ВыделенныеСтроки Цикл
		Описание = ОписаниеСтрокиПериодическиеОсмотры();
		ЗаполнитьЗначенияСвойств(Описание, ДанныеСтроки);
		ДанныеОсмотров.Добавить(Описание);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ОписаниеСтрокиПериодическиеОсмотры()
	
	Описание = Новый Структура(
		"ФизическоеЛицо,
		|РабочееМесто,
		|Направление,
		|Заключение");
	
	Возврат Описание;
	
КонецФункции

&НаКлиенте
Процедура НачатьФормированиеНаправлений()
	
	Если Элементы.ПериодическиеОсмотры.ВыделенныеСтроки.Количество() = 0 Тогда
		ВызватьИсключение НСтр("ru = 'Не выбрано ни одного сотрудника'");
	КонецЕсли;
	
	Если Элементы.ПериодическиеОсмотры.ВыделенныеСтроки.Количество() = 1 Тогда
		НачатьВводНаправления();
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура(
		"Организация,
		|ВидОсмотра,
		|ДанныеНаправлений");
	ПараметрыФормы.Организация = Организация;
	ПараметрыФормы.ВидОсмотра = ВидОсмотра;
	ПараметрыФормы.ДанныеНаправлений = Новый Массив;
	ЗаполнитьДанныеОсмотров(ПараметрыФормы.ДанныеНаправлений);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("СформироватьНаправленияПослеНастройкиЗаполнения", ЭтотОбъект);
	ОткрытьФорму("Обработка.МедицинскиеОсмотры.Форма.ЗаполнениеНаправлений", ПараметрыФормы, ЭтотОбъект, ЭтотОбъект, , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьНаправленияПослеНастройкиЗаполнения(ДанныеНаправлений, ДополнительныеПараметры) Экспорт
	
	Если ДанныеНаправлений = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДлительнаяОперация = СформироватьНаправленияНаСервере(ДанныеНаправлений);
	
	ПараметрыОповещения = Новый Структура("Печатать");
	ПараметрыОповещения.Печатать = ДанныеНаправлений.Печатать;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ТекстСообщения = НСтр("ru = 'Подготовка направлений на медицинский осмотр'");
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("СформироватьНаправленияЗавершение", ЭтотОбъект, ПараметрыОповещения);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция СформироватьНаправленияНаСервере(ДанныеНаправлений)
	
	ПараметрыПроцедуры = Новый Структура("ДанныеНаправлений");
	ПараметрыПроцедуры.ДанныеНаправлений = ДанныеНаправлений;
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Формирование направлений на медицинские осмотры'");
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("МедицинскиеОсмотры.СформироватьНаправленияДлительнаяОперация", ПараметрыПроцедуры, ПараметрыВыполнения);   	
	
КонецФункции

&НаКлиенте
Процедура СформироватьНаправленияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Элементы.ПериодическиеОсмотры.Обновить();
	
	Если ДополнительныеПараметры.Печатать = Истина Тогда
		Направления = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		НапечататьНаправления(Направления);
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура НапечататьНаправления(Направления)
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
		"Документ.НаправлениеНаМедицинскийОсмотр", "НаправлениеНаМедицинскийОсмотр", Направления, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьВводНаправления()
	
	ТекущиеДанные = Элементы.ПериодическиеОсмотры.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Направление) И Не ТекущиеДанные.ОсмотрЗавершен Тогда
		ПоказатьВопросНаправлениеСуществует(ТекущиеДанные);
		Возврат;
	КонецЕсли;
	
	ВвестиНовоеНаправление(ТекущиеДанные);
	
КонецПроцедуры 

&НаКлиенте
Процедура ПоказатьВопросНаправлениеСуществует(ТекущиеДанные)
	
	ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Для сотрудника уже введен документ %1, заключение по которому пока не проведено.'"),
		ТекущиеДанные.Направление);
		
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить(КодВозвратаДиалога.Прервать, НСтр("ru = 'Открыть существующий'"));
	Кнопки.Добавить(КодВозвратаДиалога.Пропустить, НСтр("ru = 'Создать новый'"));
	Кнопки.Добавить(КодВозвратаДиалога.Отмена);
		
	ОбработчикОповещения = Новый ОписаниеОповещения("ВвестиНовоеНаправлениеПослеВопросаНаправлениеСуществует", ЭтотОбъект, ТекущиеДанные);
	ПоказатьВопрос(ОбработчикОповещения, ТекстВопроса, Кнопки);
	
КонецПроцедуры

&НаКлиенте
Процедура ВвестиНовоеНаправлениеПослеВопросаНаправлениеСуществует(Результат, ТекущиеДанные) Экспорт
	
	Если Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат = КодВозвратаДиалога.Прервать Тогда
		ПоказатьЗначение(, ТекущиеДанные["Направление"]);
		Возврат;
	КонецЕсли;
	
	ВвестиНовоеНаправление(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ВвестиНовоеНаправление(ТекущиеДанные)
	
	ЗначенияЗаполнения = Новый Структура(
		"Организация,
		|ВидОсмотра,
		|ТипОсмотра,
		|ФизическоеЛицо,
		|РабочееМесто");
	ЗначенияЗаполнения.Организация = Организация;
	ЗначенияЗаполнения.ВидОсмотра = ВидОсмотра;
	ЗначенияЗаполнения.ТипОсмотра = ПредопределенноеЗначение("Перечисление.ТипыМедицинскогоОсмотра.Периодический");
	ЗначенияЗаполнения.ФизическоеЛицо = ТекущиеДанные.ФизическоеЛицо;
	ЗначенияЗаполнения.РабочееМесто = ТекущиеДанные.РабочееМесто;
	
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения");
	ПараметрыФормы.ЗначенияЗаполнения = ЗначенияЗаполнения;
	
	ОткрытьФорму("Документ.НаправлениеНаМедицинскийОсмотр.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ВводЗаключений

&НаКлиенте
Процедура НачатьФормированиеЗаключений()
	
	Если Элементы.ПериодическиеОсмотры.ВыделенныеСтроки.Количество() = 0 Тогда
		ВызватьИсключение НСтр("ru = 'Не выбрано ни одного сотрудника'");
	КонецЕсли;
	
	Если Элементы.ПериодическиеОсмотры.ВыделенныеСтроки.Количество() = 1 Тогда
		НачатьВводЗаключения();
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура(
		"Организация,
		|ДанныеЗаключений");
	ПараметрыФормы.Организация = Организация;
	ПараметрыФормы.ДанныеЗаключений = Новый Массив;
	ЗаполнитьДанныеОсмотров(ПараметрыФормы.ДанныеЗаключений);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("СформироватьЗаключенияПослеНастройкиЗаполнения", ЭтотОбъект);
	ОткрытьФорму("Обработка.МедицинскиеОсмотры.Форма.ЗаполнениеЗаключений", ПараметрыФормы, ЭтотОбъект, ЭтотОбъект, , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьВводЗаключения()
	
	ТекущиеДанные = Элементы.ПериодическиеОсмотры.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяОсмотра = НСтр("ru = 'медицинский осмотр'");
	ТекстЗавершен = НСтр("ru = 'завершен'");
	Если ВидОсмотра =
		ПредопределенноеЗначение("Перечисление.ВидыОбследований.ПсихиатрическоеОсвидетельствование") Тогда
		ИмяОсмотра = НСтр("ru = 'психиатрическое освидетельствование'");
		ТекстЗавершен = НСтр("ru = 'завершено'");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.Направление) Тогда
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Для выбранной строки отсутствует направление на %1.
			|Заключение можно ввести только при наличии направления.'"), ИмяОсмотра);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Заключение) Тогда
		Если Не ТекущиеДанные.ОсмотрЗавершен Тогда
			ПоказатьВопросЗаключениеСуществует(ТекущиеДанные);
			Возврат;
		КонецЕсли;
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Для выбранной строки %1 уже %2.
			|Заключение можно ввести только при наличии направления, по которому нет заключения.'"),
			ИмяОсмотра, ТекстЗавершен);
	КонецЕсли;
	
	ВвестиНовоеЗаключение(ТекущиеДанные);
	
КонецПроцедуры 

&НаКлиенте
Процедура ПоказатьВопросЗаключениеСуществует(ТекущиеДанные)
	
	ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Для сотрудника уже введен документ %1, который пока не проведен.'"),
		ТекущиеДанные.Заключение);
		
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить(КодВозвратаДиалога.Прервать, НСтр("ru = 'Открыть существующий'"));
	Кнопки.Добавить(КодВозвратаДиалога.Пропустить, НСтр("ru = 'Создать новый'"));
	Кнопки.Добавить(КодВозвратаДиалога.Отмена);
		
	ОбработчикОповещения = Новый ОписаниеОповещения("ВвестиНовоеНаправлениеПослеВопросаЗаключениеСуществует", ЭтотОбъект, ТекущиеДанные);
	ПоказатьВопрос(ОбработчикОповещения, ТекстВопроса, Кнопки);
	
КонецПроцедуры

&НаКлиенте
Процедура ВвестиНовоеНаправлениеПослеВопросаЗаключениеСуществует(Результат, ТекущиеДанные) Экспорт
	
	Если Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат = КодВозвратаДиалога.Прервать Тогда
		ПоказатьЗначение(, ТекущиеДанные["Заключение"]);
		Возврат;
	КонецЕсли;
	
	ВвестиНовоеЗаключение(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ВвестиНовоеЗаключение(ТекущиеДанные)
	
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения");
	ПараметрыФормы.ЗначенияЗаполнения = Новый Структура("Направление");
	ПараметрыФормы.ЗначенияЗаполнения.Направление = ТекущиеДанные.Направление;
	
	ОткрытьФорму("Документ.ЗаключениеМедицинскогоОсмотра.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьЗаключенияПослеНастройкиЗаполнения(ДанныеЗаключений, ДополнительныеПараметры) Экспорт
	
	Если ДанныеЗаключений = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДлительнаяОперация = СформироватьЗаключенияНаСервере(ДанныеЗаключений);
	
	ПараметрыОповещения = Новый Структура("Печатать");
	ПараметрыОповещения.Печатать = ДанныеЗаключений.Печатать;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ТекстСообщения = НСтр("ru = 'Подготовка заключений медицинских осмотров'");
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("СформироватьЗаключенияЗавершение", ЭтотОбъект, ПараметрыОповещения);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция СформироватьЗаключенияНаСервере(ДанныеЗаключений)
	
	ПараметрыПроцедуры = Новый Структура("ДанныеЗаключений");
	ПараметрыПроцедуры.ДанныеЗаключений = ДанныеЗаключений;
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Формирование заключений по результатам медицинского осмотра'");
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("МедицинскиеОсмотры.СформироватьЗаключенияДлительнаяОперация", ПараметрыПроцедуры, ПараметрыВыполнения);   	
	
КонецФункции

&НаКлиенте
Процедура СформироватьЗаключенияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ЗапуститьОбновлениеПериодическихОсмотров(Организация);
	Элементы.ПериодическиеОсмотры.Обновить();
	
КонецПроцедуры 

&НаСервереБезКонтекста
Процедура ЗапуститьОбновлениеПериодическихОсмотров(Организация)
	МедицинскиеОсмотры.ЗапуститьОбновлениеПериодическихОсмотров(Организация);
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ПроверитьНаличиеНеактуальныхЗаписейПериодическихОсмотров()
	
	БылиНеАктуальныеЗаписи = Элементы.ОбновлениеДанныхГруппа.Видимость;
	
	ЕстьНеактуальныеЗаписи = ЕстьНеактуальныеЗаписиПериодическихОсмотров(Организация);
	УстановитьНадписьОбновитьПериодическиеОсмотры(ЭтотОбъект, ЕстьНеактуальныеЗаписи);
	
	ВсеПозицииБезВредности = ВсеПозицииБезВредности(Организация, ВидОсмотра);
	УстановитьНадписьПояснениеПустогоСпискаПериодическихОсмотров(ЭтотОбъект, ВсеПозицииБезВредности);
	
	Если БылиНеАктуальныеЗаписи И Не ЕстьНеактуальныеЗаписи Тогда
		Элементы.ПериодическиеОсмотры.Обновить();
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ОткрытьСотрудника(ТекущиеДанные, Поле)
	
	Если Поле.Имя <> "ФизическоеЛицо" Тогда
		Возврат;
	КонецЕсли;
	
	Сотрудник = СотрудникПоФизическомуЛицу(ТекущиеДанные["ФизическоеЛицо"], ТекущиеДанные["РабочееМесто"], Организация);
	
	ПоказатьЗначение(, Сотрудник);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПозицию(ТекущиеДанные, Поле)
	
	Если Поле.Имя <> "Позиция" Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура(
		"Ключ, 
		|ТекущаяСтраницаОхранаТруда");
	ПараметрыФормы.Ключ = ТекущиеДанные["Позиция"];
	ПараметрыФормы.ТекущаяСтраницаОхранаТруда = Истина;
	
	ОткрытьФорму("Справочник.ШтатноеРасписание.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРабочееМесто(ТекущиеДанные, Поле)
	
	Если Поле.Имя <> "РабочееМесто" Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Ключ");
	ПараметрыФормы.Ключ = ТекущиеДанные["РабочееМесто"];
	
	Если Не ЗначениеЗаполнено(ПараметрыФормы.Ключ) Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("Справочник.РабочиеМестаОхраныТруда.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНаправление(ТекущиеДанные, Поле)
	
	Если Поле.Имя <> "Направление" Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьЗначение(, ТекущиеДанные["Направление"]);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗаключение(ТекущиеДанные, Поле)
	
	Если Поле.Имя <> "Заключение" Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьЗначение(, ТекущиеДанные["Заключение"]);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СотрудникПоФизическомуЛицу(ФизическоеЛицо, РабочееМесто, Организация)
	
	Возврат МедицинскиеОсмотры.СотрудникПоФизическомуЛицу(ФизическоеЛицо, РабочееМесто, Организация);
	
КонецФункции

&НаКлиенте
Процедура НачатьОбновлениеПериодическихОсмотров()
	
	ДлительнаяОперация = ОбновитьПериодическиеОсмотрыНаСервере();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ТекстСообщения = НСтр("ru = 'Обновление сведений о периодических медицинских осмотрах'");
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбновлениеПериодическихОсмотровЗавершение", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеПериодическихОсмотровЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ПроверитьНаличиеНеактуальныхЗаписейПериодическихОсмотров();
	
КонецПроцедуры 

&НаСервере
Функция ОбновитьПериодическиеОсмотрыНаСервере()
	
	ПараметрыПроцедуры = Новый Структура("Организация");
	ПараметрыПроцедуры.Организация = Организация;
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Обновление сведений о периодических медицинских осмотрах'");
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("МедицинскиеОсмотры.ОбновитьПериодическиеОсмотрыОрганизацииДлительнаяОперация", ПараметрыПроцедуры, ПараметрыВыполнения);   	
	
КонецФункции

&НаСервере
Процедура ЗаполнитьНачальныеЗначения()
	
	ЗначенияДляЗаполнения = Новый Структура;
	Если Не ЗначениеЗаполнено(Организация) Тогда
		ЗначенияДляЗаполнения.Вставить("Организация", "Организация");
	КонецЕсли;
	ЗарплатаКадры.ЗаполнитьПервоначальныеЗначенияВФорме(ЭтотОбъект, ЗначенияДляЗаполнения);
	
	Если Не ЗначениеЗаполнено(ВидОсмотра) Тогда
		ВидОсмотра = Перечисления.ВидыОбследований.МедицинскийОсмотр;
	КонецЕсли;
	
	ПоказыватьТолькоТребующиеПодтверждения = Истина;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьПараметрВидОсмотра(Форма)
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Форма.РабочиеМеста, "ВидОсмотра", Форма.ВидОсмотра);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Форма.ПериодическиеОсмотры, "ВидОсмотра", Форма.ВидОсмотра);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Форма.СоответствиеПеречнейВредныхФакторов, "ВидОсмотра", Форма.ВидОсмотра);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьПараметрТекущаяДата(Форма, ТекущаяДата)
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Форма.ПериодическиеОсмотры, "ТекущаяДата", ТекущаяДата);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Форма.РабочиеМеста, "ТекущаяДата", ТекущаяДата);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборПоОрганизации(Форма)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Форма.РабочиеМеста, "Организация", Форма.Организация);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Форма.ПериодическиеОсмотры, "Организация", Форма.Организация);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборПоПодразделению(Форма)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Форма.РабочиеМеста, "Подразделение", Форма.Подразделение, , , ЗначениеЗаполнено(Форма.Подразделение));
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Форма.ПериодическиеОсмотры, "Подразделение", Форма.Подразделение, , , ЗначениеЗаполнено(Форма.Подразделение));
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	Сегодня = НачалоДня(ТекущаяДатаСеанса());
	
	// Просрочен осмотр.
	ЭлементОформления = ПериодическиеОсмотры.УсловноеОформление.Элементы.Добавить();
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		ЭлементОформления.Отбор, "ДатаСледующегоОсмотра", Сегодня, ВидСравненияКомпоновкиДанных.МеньшеИлиРавно);
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.СостояниеМедосмотраКритичноеЦветТекста);
	
	// Однократный осмотр.
	ЭлементОформления = ПериодическиеОсмотры.УсловноеОформление.Элементы.Добавить();
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		ЭлементОформления.Отбор, "ДатаСледующегоОсмотра", НачалоДня(ЗарплатаКадрыПериодическиеРегистры.МаксимальнаяДата()));
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '< Не требуется >'"));
	ПолеЭлемента = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДатаСледующегоОсмотра");
	
	// Имеет противопоказания.
	ЭлементОформления = ПериодическиеОсмотры.УсловноеОформление.Элементы.Добавить();
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭлементОформления.Отбор, "РезультатОсмотра", Перечисления.РезультатыМедицинскогоОсмотра.ИмеетПротивопоказания);
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.СостояниеМедосмотраКритичноеЦветТекста);
	
	ЖирныйШрифт = Новый Шрифт(Элементы.ПериодическиеОсмотры.Шрифт, , , Истина);
	
	// Нет результата.
	ЭлементОформления = ПериодическиеОсмотры.УсловноеОформление.Элементы.Добавить();
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭлементОформления.Отбор, "РезультатОсмотра", , ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", ЖирныйШрифт);
	
	// Отсутствуют соответствия.
	ЭлементОформления = СоответствиеПеречнейВредныхФакторов.УсловноеОформление.Элементы.Добавить();
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭлементОформления.Отбор, "СоответствиеПодтверждено", Ложь);
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.СостояниеМедосмотраКритичноеЦветТекста);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОформитьСтрокиПериодическихОсмотров(ИмяЭлемента, Настройки, Строки)
	
	Сегодня = НачалоДня(ТекущаяДатаСеанса());
	
	Для Каждого СтрокаСписка Из Строки Цикл
		ДанныеСтроки = СтрокаСписка.Значение.Данные;
		ОформлениеСтроки = СтрокаСписка.Значение.Оформление;
		ОтображатьКартинкуПредупреждение = Ложь;
		ВыделятьКраснымЦветом = Ложь;
		ТекстСостояния = Неопределено;
		// До медосмотра меньше месяца.
		Если ДанныеСтроки.ДатаСледующегоОсмотра > Сегодня И ДанныеСтроки.ДатаСледующегоОсмотра < ДобавитьМесяц(Сегодня, 1) Тогда
			ТекстСостояния = НСтр("ru = 'До осмотра меньше месяца'");
		КонецЕсли;
		// Медосмотра просрочен или не проходился.
		Если ДанныеСтроки.ДатаСледующегоОсмотра <= Сегодня Тогда
			ТекстСостояния = НСтр("ru = 'Пройти осмотр немедленно'");
			ОтображатьКартинкуПредупреждение = Истина;
			ВыделятьКраснымЦветом = Истина;
		КонецЕсли;
		// Есть противопоказания.
		Если ДанныеСтроки.РезультатОсмотра = Перечисления.РезультатыМедицинскогоОсмотра.ИмеетПротивопоказания Тогда
			ТекстСостояния = НСтр("ru = 'Имеются противопоказания, требуется отстранение от работы'");
			ОтображатьКартинкуПредупреждение = Истина;
			ВыделятьКраснымЦветом = Истина;
		КонецЕсли;
		// В процессе осмотра.
		Если ЗначениеЗаполнено(ДанныеСтроки.Направление) И Не ЗначениеЗаполнено(ДанныеСтроки.РезультатОсмотра) Тогда
			ОтображатьКартинкуПредупреждение = Ложь;
			ВыделятьКраснымЦветом = Ложь;
			Если Не ЗначениеЗаполнено(ДанныеСтроки.Заключение) Тогда
				ТекстСостояния = НСтр("ru = 'Направлен на осмотр, заключения пока нет'");
			КонецЕсли;
			Если ЗначениеЗаполнено(ДанныеСтроки.Заключение) Тогда
				ТекстСостояния = НСтр("ru = 'Заключение получено, но документ не проведен'");
			КонецЕсли;
		КонецЕсли;
		Если Не ОтображатьКартинкуПредупреждение Тогда
			УстановитьЗначениеПараметраОформленияПоля(ОформлениеСтроки, "ПредупреждениеКартинка", "Отображать", Ложь);
		КонецЕсли;
		УстановитьЗначениеПараметраОформленияПоля(ОформлениеСтроки, "СостояниеОсмотра", "Текст", ТекстСостояния);
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьЗначениеПараметраОформленияПоля(ОформлениеСтроки, ИмяПоля, Параметр, Значение)
	
	ОформлениеЯчейки = ОформлениеСтроки.Получить(ИмяПоля);
	
	Если ОформлениеЯчейки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОформлениеЯчейки.УстановитьЗначениеПараметра(Параметр, Значение);
	
КонецПроцедуры

&НаСервере
Процедура ДоработатьПользовательскиеНастройкиСпискаРабочихМест()
	
	Элементы.РабочиеМеста.СоздатьЭлементыФормыПользовательскихНастроек(Элементы.ПользовательскиеНастройкиРабочихМестГруппа);
	Для Каждого ЭлементНастроек Из Элементы.ПользовательскиеНастройкиРабочихМестГруппа.ПодчиненныеЭлементы Цикл
		Если ЭлементНастроек.Вид = ВидПоляФормы.ПолеФлажка Тогда
			ЭлементНастроек.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборТолькоБлижайшиеОсмотры(Форма, ТекущаяДата, Использование)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Форма.ПериодическиеОсмотры, 
		"ДатаСледующегоОсмотра", 
		ДобавитьМесяц(НачалоДня(ТекущаяДата), 1), 
		ВидСравненияКомпоновкиДанных.МеньшеИлиРавно, , 
		Использование);
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборСоответствий(Форма, ИмяПоля, Использование)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Форма.СоответствиеПеречнейВредныхФакторов, 
		ИмяПоля, 
		Ложь, 
		ВидСравненияКомпоновкиДанных.Равно, , 
		Использование);
		
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПроверитьСтраницуСоответствия(Форма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы, "СопоставлениеСтраница", "Видимость", ЕстьВредныеФакторыТребующиеПодтвержденияВРабочихМестах(Форма));
	
	Если Форма.ВидОсмотра = Перечисления.ВидыОбследований.МедицинскийОсмотр Тогда
		Форма.Элементы.СопоставлениеСтраница.Заголовок = НСтр("ru = 'Соответствие перечня № 302н перечню № 29н'");
		Форма.Элементы.ПояснениеСопоставленияНадпись.Заголовок =
			НСтр("ru = 'Вредные факторы из приказа №302н, которым не удалось автоматически установить однозначное соответствие с вредными факторами из приказа №29н. Для установки соответствия откройте карточку вредного фактора из списка, подтвердите или измените набор вредных факторов из приказа №29н.'");
	ИначеЕсли Форма.ВидОсмотра = Перечисления.ВидыОбследований.ПсихиатрическоеОсвидетельствование Тогда
		Форма.Элементы.СопоставлениеСтраница.Заголовок = НСтр("ru = 'Соответствие перечня № 695 перечню № 342н'");
		Форма.Элементы.ПояснениеСопоставленияНадпись.Заголовок =
			НСтр("ru = 'Вредные факторы из приказа № 695, для которых не установлено соответствие с видами деятельности из приказа №342н. Для установки соответствия откройте карточку вредного фактора из списка, подтвердите или измените набор видов деятельности из приказа №342н.'");
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьВредныеФакторыТребующиеПодтвержденияВРабочихМестах(Форма)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ИСТИНА
		|ИЗ
		|	Справочник.ВредныеОпасныеПроизводственныеФакторы КАК ВредныеФакторыСправочник
		|ГДЕ
		|	НЕ ВредныеФакторыСправочник.ЭтоГруппа
		|	И НЕ ВредныеФакторыСправочник.СоответствиеПодтверждено
		|	И ВЫБОР
		|		КОГДА ИСТИНА В
		|			(ВЫБРАТЬ ПЕРВЫЕ 1
		|				ИСТИНА
		|			ИЗ
		|				РегистрСведений.ВредныеФакторыРабочегоМеста КАК ВредныеФакторыРабочегоМеста
		|			ГДЕ
		|				ВредныеФакторыРабочегоМеста.ВредныйФактор = ВредныеФакторыСправочник.Ссылка)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ
		|	И ВредныеФакторыСправочник.ВидОсмотра = &ВидОсмотра
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИСТИНА
		|ИЗ
		|	Справочник.ВидыРаботМедицинскихОсмотров КАК ВидыРаботСправочник
		|ГДЕ
		|	НЕ ВидыРаботСправочник.СоответствиеПодтверждено
		|	И ВЫБОР
		|		КОГДА ИСТИНА В
		|			(ВЫБРАТЬ ПЕРВЫЕ 1
		|				ИСТИНА
		|			ИЗ
		|				РегистрСведений.ВидыРаботМедицинскихОсмотровРабочегоМеста КАК ВидыРаботМедицинскихОсмотровРабочегоМеста
		|			ГДЕ
		|				ВидыРаботМедицинскихОсмотровРабочегоМеста.ВидРабот = ВидыРаботСправочник.Ссылка)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ
		|	И ВидыРаботСправочник.ВидОсмотра = &ВидОсмотра
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИСТИНА
		|ИЗ
		|	Справочник.ВредныеОпасныеПроизводственныеФакторыИВыполняемыеРаботы КАК ВредныеФакторыВидыРаботСправочник
		|ГДЕ
		|	НЕ ВредныеФакторыВидыРаботСправочник.ЭтоГруппа
		|	И НЕ ВредныеФакторыВидыРаботСправочник.СоответствиеПодтверждено
		|	И ВЫБОР
		|		КОГДА ИСТИНА В
		|			(ВЫБРАТЬ ПЕРВЫЕ 1
		|				ИСТИНА
		|			ИЗ
		|				РегистрСведений.ВредныеФакторыИВидыРаботРабочегоМеста КАК ВредныеФакторыИВидыРаботРабочегоМеста
		|			ГДЕ
		|				ВредныеФакторыИВидыРаботРабочегоМеста.ВредныйФактор = ВредныеФакторыВидыРаботСправочник.Ссылка)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ
		|	И ВредныеФакторыВидыРаботСправочник.ВАрхиве
		|	И ВредныеФакторыВидыРаботСправочник.ВидОсмотра = &ВидОсмотра";
	
	Запрос.УстановитьПараметр("ВидОсмотра", Форма.ВидОсмотра);
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	ВсеПозицииБезВредности = ВсеПозицииБезВредности(Организация, ВидОсмотра);
	УстановитьНадписьПояснениеПустогоСпискаПериодическихОсмотров(ЭтотОбъект, ВсеПозицииБезВредности);
	
	ЕстьНеактуальныеЗаписи = ЕстьНеактуальныеЗаписиПериодическихОсмотров(Организация);
	УстановитьНадписьОбновитьПериодическиеОсмотры(ЭтотОбъект, ЕстьНеактуальныеЗаписи);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьНадписьПояснениеПустогоСпискаПериодическихОсмотров(Форма, ВсеПозицииБезВредности)
	
	Форма.Элементы.ПояснениеИспользованияГруппа.Видимость = ВсеПозицииБезВредности;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьНадписьОбновитьПериодическиеОсмотры(Форма, ЕстьНеактуальныеЗаписи)
	
	Форма.Элементы.ОбновлениеДанныхГруппа.Видимость = ЕстьНеактуальныеЗаписи;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьНеактуальныеЗаписиПериодическихОсмотров(Организация)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ГоловнаяОрганизация", ЗарплатаКадры.ГоловнаяОрганизация(Организация));
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИСТИНА КАК Поле1
		|ИЗ
		|	РегистрСведений.ОбновлениеПериодическихМедицинскихОсмотров КАК ОбновлениеОсмотров
		|ГДЕ
		|	ОбновлениеОсмотров.ГоловнаяОрганизация = &ГоловнаяОрганизация";
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции

&НаСервереБезКонтекста
Функция ВсеПозицииБезВредности(Организация, ВидОсмотра)
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ВидОсмотра) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ВидОсмотра", ВидОсмотра);
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИСТИНА
		|ИЗ
		|	Справочник.РабочиеМестаОхраныТруда КАК РабочиеМестаОхраныТруда
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПериодичностьМедицинскихОсмотровРабочихМест КАК ПериодичностьРабочихМест
		|		ПО (РабочиеМестаОхраныТруда.Ссылка = ПериодичностьРабочихМест.РабочееМесто)
		|		И (РабочиеМестаОхраныТруда.Владелец = &Организация)
		|		И (ПериодичностьРабочихМест.ВидОсмотра = &ВидОсмотра)";
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат РезультатЗапроса.Пустой();
	
КонецФункции

#КонецОбласти
